# Data preprocessing

In [127]:
from telnetlib import Telnet

'''
import kagglehub

# Download latest version
path = kagglehub.dataset_download("shubhambathwal/flight-price-prediction")

print("Path to dataset files:", path)
'''

'\nimport kagglehub\n\n# Download latest version\npath = kagglehub.dataset_download("shubhambathwal/flight-price-prediction")\n\nprint("Path to dataset files:", path)\n'

In [ ]:
import pandas as pd
import matplotlib.pyplot as plt

## Load data

In [129]:
df_economy = pd.read_csv('economy.csv')
df_business = pd.read_csv('business.csv')

In [130]:
df_economy.head()

,date,airline,ch_code,num_code,dep_time,from,time_taken,stop,arr_time,to,price
0,11-02-2022,SpiceJet,SG,8709,18:55,Delhi,02h 10m,non-stop,21:05,Mumbai,"5,953"
1,11-02-2022,SpiceJet,SG,8157,06:20,Delhi,02h 20m,non-stop,08:40,Mumbai,"5,953"
2,11-02-2022,AirAsia,I5,764,04:25,Delhi,02h 10m,non-stop,06:35,Mumbai,"5,956"
3,11-02-2022,Vistara,UK,995,10:20,Delhi,02h 15m,non-stop,12:35,Mumbai,"5,955"
4,11-02-2022,Vistara,UK,963,08:50,Delhi,02h 20m,non-stop,11:10,Mumbai,"5,955"

In [131]:
df_business.head()

,date,airline,ch_code,num_code,dep_time,from,time_taken,stop,arr_time,to,price
0,11-02-2022,Air India,AI,868,18:00,Delhi,02h 00m,non-stop,20:00,Mumbai,"25,612"
1,11-02-2022,Air India,AI,624,19:00,Delhi,02h 15m,non-stop,21:15,Mumbai,"25,612"
2,11-02-2022,Air India,AI,531,20:00,Delhi,24h 45m,1-stop\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t...,20:45,Mumbai,"42,220"
3,11-02-2022,Air India,AI,839,21:25,Delhi,26h 30m,1-stop\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t...,23:55,Mumbai,"44,450"
4,11-02-2022,Air India,AI,544,17:15,Delhi,06h 40m,1-stop\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t...,23:55,Mumbai,"46,690"

### Airline analysis

In [132]:
df_economy['airline'].value_counts()

airline
Vistara      67270
Air India    47996
Indigo       43120
GO FIRST     23177
AirAsia      16098
SpiceJet      9011
StarAir         61
Trujet          41
Name: count, dtype: int64

In [133]:
df_business['airline'].value_counts()

airline
Vistara      60589
Air India    32898
Name: count, dtype: int64

### From/To Analysis

In [134]:
df_economy['from'].value_counts()

from
Delhi        43029
Mumbai       41045
Bangalore    35665
Kolkata      32874
Hyderabad    27990
Chennai      26171
Name: count, dtype: int64

In [135]:
df_economy['to'].value_counts()

to
Delhi        40654
Mumbai       40118
Bangalore    34914
Kolkata      34777
Hyderabad    29101
Chennai      27210
Name: count, dtype: int64

In [136]:
df_business['from'].value_counts()

from
Mumbai       19858
Delhi        18316
Bangalore    16441
Kolkata      13473
Hyderabad    12870
Chennai      12529
Name: count, dtype: int64

In [137]:
df_business['to'].value_counts()

to
Mumbai       18991
Delhi        16707
Bangalore    16198
Kolkata      14758
Hyderabad    13675
Chennai      13158
Name: count, dtype: int64

In [138]:
df_business.dtypes

date          object
airline       object
ch_code       object
num_code       int64
dep_time      object
from          object
time_taken    object
stop          object
arr_time      object
to            object
price         object
dtype: object

## Data preparation
### Conversion of time_taken from categories to hours (float)

In [139]:
# convert time_taken to hours flight_duration

def time_to_hours(time_str: str) -> float:
    parts = time_str.split(" ")
    hours = 0
    minutes = 0
    try:
        hours = float(parts[0].replace('h', ''))
        minutes = float(parts[1].replace('m', ''))
    except ValueError as e:
        print(time_str)
        print(e)
    return hours + minutes / 60

df_economy['time_taken'] = df_economy['time_taken'].apply(time_to_hours)
df_business['time_taken'] = df_business['time_taken'].apply(time_to_hours)
df_economy

1.03h m
could not convert string to float: ''
1.02h m
could not convert string to float: ''
1.03h m
could not convert string to float: ''
1.01h m
could not convert string to float: ''

,date,airline,ch_code,num_code,dep_time,from,time_taken,stop,arr_time,to,price
0,11-02-2022,SpiceJet,SG,8709,18:55,Delhi,2.166667,non-stop,21:05,Mumbai,"5,953"
1,11-02-2022,SpiceJet,SG,8157,06:20,Delhi,2.333333,non-stop,08:40,Mumbai,"5,953"
2,11-02-2022,AirAsia,I5,764,04:25,Delhi,2.166667,non-stop,06:35,Mumbai,"5,956"
3,11-02-2022,Vistara,UK,995,10:20,Delhi,2.250000,non-stop,12:35,Mumbai,"5,955"
4,11-02-2022,Vistara,UK,963,08:50,Delhi,2.333333,non-stop,11:10,Mumbai,"5,955"
...,...,...,...,...,...,...,...,...,...,...,...
206769,31-03-2022,Vistara,UK,832,07:05,Chennai,13.833333,1-stop\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t...,20:55,Hyderabad,"7,697"
206770,31-03-2022,Vistara,UK,832,07:05,Chennai,13.833333,1-stop\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t...,20:55,Hyderabad,"7,709"
206771,31-03-2022,Vistara,UK,826,12:30,Chennai,20.583333,1-stop\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t...,09:05,Hyderabad,"8,640"
206772,31-03-2022,Vistara,UK,822,09:45,Chennai,23.333333,1-stop\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t...,09:05,Hyderabad,"8,640"
206773,31-03-2022,Vistara,UK,824,20:30,Chennai,24.416667,1-stop\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t...,20:55,Hyderabad,"8,640"

In [140]:
df_economy['time_taken'].value_counts()

time_taken
2.166667     3081
2.250000     2912
2.750000     2006
2.083333     1969
2.833333     1724
             ...
47.750000       1
40.750000       1
38.500000       1
44.500000       1
41.500000       1
Name: count, Length: 479, dtype: int64

### Concatenation of ch_code and num_code to make up the flight_number

In [141]:
df_economy['flight_number'] = df_economy['ch_code'] + df_economy['num_code'].astype(str)
df_economy.drop(['ch_code', 'num_code'], axis=1, inplace=True)
df_business['flight_number'] = df_business['ch_code'] + df_business['num_code'].astype(str)
df_business.drop(['ch_code', 'num_code'], axis=1, inplace=True)

In [142]:
df_economy['stop'].value_counts()

stop
1-stop\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t                      162114
non-stop                                                                         27942
2+-stop                                                                          12205
1-stop\n\t\t\t\t\t\t\t\t\t\t\t\tVia IXU\n\t\t\t\t\t\t\t\t\t\t\t\t                 1063
1-stop\n\t\t\t\t\t\t\t\t\t\t\t\tVia IDR\n\t\t\t\t\t\t\t\t\t\t\t\t                  588
1-stop\n\t\t\t\t\t\t\t\t\t\t\t\tVia Patna\n\t\t\t\t\t\t\t\t\t\t\t\t                432
1-stop\n\t\t\t\t\t\t\t\t\t\t\t\tVia Indore\n\t\t\t\t\t\t\t\t\t\t\t\t               381
1-stop\n\t\t\t\t\t\t\t\t\t\t\t\tVia MYQ\n\t\t\t\t\t\t\t\t\t\t\t\t                  321
1-stop\n\t\t\t\t\t\t\t\t\t\t\t\tVia KLH\n\t\t\t\t\t\t\t\t\t\t\t\t                  284
1-stop\n\t\t\t\t\t\t\t\t\t\t\t\tVia Bhubaneswar\n\t\t\t\t\t\t\t\t\t\t\t\t          226
1-stop\n\t\t\t\t\t\t\t\t\t\t\t\tVia JGB\n\t\t\t\t\t\t\t\t\t\t\t\t                  193
1-stop\n\t\t\t\t\t\t\t\t\t\t\t\tVia JRG\n\t\t\t\t\t\t\t\t\t\t\t\t                  175
1-stop\n\t\t\t\t\t\t\t\t\t\t\t\tVia Ranchi\n\t\t\t\t\t\t\t\t\t\t\t\t               114
1-stop\n\t\t\t\t\t\t\t\t\t\t\t\tVia PAT\n\t\t\t\t\t\t\t\t\t\t\t\t                   97
1-stop\n\t\t\t\t\t\t\t\t\t\t\t\tVia Delhi\n\t\t\t\t\t\t\t\t\t\t\t\t                 94
1-stop\n\t\t\t\t\t\t\t\t\t\t\t\tVia STV\n\t\t\t\t\t\t\t\t\t\t\t\t                   76
1-stop\n\t\t\t\t\t\t\t\t\t\t\t\tVia Hyderabad\n\t\t\t\t\t\t\t\t\t\t\t\t             72
1-stop\n\t\t\t\t\t\t\t\t\t\t\t\tVia Raipur\n\t\t\t\t\t\t\t\t\t\t\t\t                59
1-stop\n\t\t\t\t\t\t\t\t\t\t\t\tVia Mysore\n\t\t\t\t\t\t\t\t\t\t\t\t                45
1-stop\n\t\t\t\t\t\t\t\t\t\t\t\tVia Mangalore\n\t\t\t\t\t\t\t\t\t\t\t\t             39
1-stop\n\t\t\t\t\t\t\t\t\t\t\t\tVia Chennai\n\t\t\t\t\t\t\t\t\t\t\t\t               35
1-stop\n\t\t\t\t\t\t\t\t\t\t\t\tVia IXE\n\t\t\t\t\t\t\t\t\t\t\t\t                   34
1-stop\n\t\t\t\t\t\t\t\t\t\t\t\tVia Mumbai\n\t\t\t\t\t\t\t\t\t\t\t\t                31
1-stop\n\t\t\t\t\t\t\t\t\t\t\t\tVia Guwahati\n\t\t\t\t\t\t\t\t\t\t\t\t              26
1-stop\n\t\t\t\t\t\t\t\t\t\t\t\tVia Nagpur\n\t\t\t\t\t\t\t\t\t\t\t\t                25
1-stop\n\t\t\t\t\t\t\t\t\t\t\t\tVia GOP\n\t\t\t\t\t\t\t\t\t\t\t\t                   16
1-stop\n\t\t\t\t\t\t\t\t\t\t\t\tVia Kolkata\n\t\t\t\t\t\t\t\t\t\t\t\t               14
1-stop\n\t\t\t\t\t\t\t\t\t\t\t\tVia Surat\n\t\t\t\t\t\t\t\t\t\t\t\t                 11
1-stop\n\t\t\t\t\t\t\t\t\t\t\t\tVia VTZ\n\t\t\t\t\t\t\t\t\t\t\t\t                   10
1-stop\n\t\t\t\t\t\t\t\t\t\t\t\tVia RPR\n\t\t\t\t\t\t\t\t\t\t\t\t                    9
1-stop\n\t\t\t\t\t\t\t\t\t\t\t\tVia NAG\n\t\t\t\t\t\t\t\t\t\t\t\t                    9
1-stop\n\t\t\t\t\t\t\t\t\t\t\t\tVia Vishakhapatnam\n\t\t\t\t\t\t\t\t\t\t\t\t         8
1-stop\n\t\t\t\t\t\t\t\t\t\t\t\tVia NDC\n\t\t\t\t\t\t\t\t\t\t\t\t                    8
1-stop\n\t\t\t\t\t\t\t\t\t\t\t\tVia BBI\n\t\t\t\t\t\t\t\t\t\t\t\t                    6
1-stop\n\t\t\t\t\t\t\t\t\t\t\t\tVia Kolhapur\n\t\t\t\t\t\t\t\t\t\t\t\t               5
1-stop\n\t\t\t\t\t\t\t\t\t\t\t\tVia IXR\n\t\t\t\t\t\t\t\t\t\t\t\t                    4
1-stop\n\t\t\t\t\t\t\t\t\t\t\t\tVia Lucknow\n\t\t\t\t\t\t\t\t\t\t\t\t                3
Name: count, dtype: int64

In [143]:
df_business['stop'].value_counts()

stop
1-stop\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t                   81489
non-stop                                                                      8102
2+-stop                                                                       1083
1-stop\n\t\t\t\t\t\t\t\t\t\t\t\tVia IDR\n\t\t\t\t\t\t\t\t\t\t\t\t              810
1-stop\n\t\t\t\t\t\t\t\t\t\t\t\tVia IXU\n\t\t\t\t\t\t\t\t\t\t\t\t              776
1-stop\n\t\t\t\t\t\t\t\t\t\t\t\tVia PAT\n\t\t\t\t\t\t\t\t\t\t\t\t              257
1-stop\n\t\t\t\t\t\t\t\t\t\t\t\tVia Patna\n\t\t\t\t\t\t\t\t\t\t\t\t            242
1-stop\n\t\t\t\t\t\t\t\t\t\t\t\tVia BBI\n\t\t\t\t\t\t\t\t\t\t\t\t              152
1-stop\n\t\t\t\t\t\t\t\t\t\t\t\tVia STV\n\t\t\t\t\t\t\t\t\t\t\t\t               93
1-stop\n\t\t\t\t\t\t\t\t\t\t\t\tVia IXE\n\t\t\t\t\t\t\t\t\t\t\t\t               86
1-stop\n\t\t\t\t\t\t\t\t\t\t\t\tVia Bhubaneswar\n\t\t\t\t\t\t\t\t\t\t\t\t       75
1-stop\n\t\t\t\t\t\t\t\t\t\t\t\tVia Hyderabad\n\t\t\t\t\t\t\t\t\t\t\t\t         71
1-stop\n\t\t\t\t\t\t\t\t\t\t\t\tVia Delhi\n\t\t\t\t\t\t\t\t\t\t\t\t             59
1-stop\n\t\t\t\t\t\t\t\t\t\t\t\tVia Raipur\n\t\t\t\t\t\t\t\t\t\t\t\t            43
1-stop\n\t\t\t\t\t\t\t\t\t\t\t\tVia Chennai\n\t\t\t\t\t\t\t\t\t\t\t\t           42
1-stop\n\t\t\t\t\t\t\t\t\t\t\t\tVia Guwahati\n\t\t\t\t\t\t\t\t\t\t\t\t          29
1-stop\n\t\t\t\t\t\t\t\t\t\t\t\tVia VTZ\n\t\t\t\t\t\t\t\t\t\t\t\t               17
1-stop\n\t\t\t\t\t\t\t\t\t\t\t\tVia Kolkata\n\t\t\t\t\t\t\t\t\t\t\t\t           14
1-stop\n\t\t\t\t\t\t\t\t\t\t\t\tVia NDC\n\t\t\t\t\t\t\t\t\t\t\t\t               14
1-stop\n\t\t\t\t\t\t\t\t\t\t\t\tVia RPR\n\t\t\t\t\t\t\t\t\t\t\t\t               13
1-stop\n\t\t\t\t\t\t\t\t\t\t\t\tVia Lucknow\n\t\t\t\t\t\t\t\t\t\t\t\t           10
1-stop\n\t\t\t\t\t\t\t\t\t\t\t\tVia GAY\n\t\t\t\t\t\t\t\t\t\t\t\t                3
1-stop\n\t\t\t\t\t\t\t\t\t\t\t\tVia GAU\n\t\t\t\t\t\t\t\t\t\t\t\t                3
1-stop\n\t\t\t\t\t\t\t\t\t\t\t\tVia Surat\n\t\t\t\t\t\t\t\t\t\t\t\t              3
1-stop\n\t\t\t\t\t\t\t\t\t\t\t\tVia HYD\n\t\t\t\t\t\t\t\t\t\t\t\t                1
Name: count, dtype: int64

### Convert the number of stops from strings to numeric values (0, 1, or 2)

In [144]:
def convert_stops(stops_str: str) -> int:
    stops = stops_str.split("-")[0][0]
    return 0 if stops == "n" else int(stops)

df_economy['stop'] = df_economy['stop'].apply(convert_stops)
df_business['stop'] = df_business['stop'].apply(convert_stops)
df_economy

,date,airline,dep_time,from,time_taken,stop,arr_time,to,price,flight_number
0,11-02-2022,SpiceJet,18:55,Delhi,2.166667,0,21:05,Mumbai,"5,953",SG8709
1,11-02-2022,SpiceJet,06:20,Delhi,2.333333,0,08:40,Mumbai,"5,953",SG8157
2,11-02-2022,AirAsia,04:25,Delhi,2.166667,0,06:35,Mumbai,"5,956",I5764
3,11-02-2022,Vistara,10:20,Delhi,2.250000,0,12:35,Mumbai,"5,955",UK995
4,11-02-2022,Vistara,08:50,Delhi,2.333333,0,11:10,Mumbai,"5,955",UK963
...,...,...,...,...,...,...,...,...,...,...
206769,31-03-2022,Vistara,07:05,Chennai,13.833333,1,20:55,Hyderabad,"7,697",UK832
206770,31-03-2022,Vistara,07:05,Chennai,13.833333,1,20:55,Hyderabad,"7,709",UK832
206771,31-03-2022,Vistara,12:30,Chennai,20.583333,1,09:05,Hyderabad,"8,640",UK826
206772,31-03-2022,Vistara,09:45,Chennai,23.333333,1,09:05,Hyderabad,"8,640",UK822
206773,31-03-2022,Vistara,20:30,Chennai,24.416667,1,20:55,Hyderabad,"8,640",UK824

### Convert departure and arrival times from HH:MM to categories (*Morning, Afternoon, Evening, Night*)

In [145]:
def time_to_category(time_str: str) -> str:
    hour = int(time_str.split(':')[0])  # Extract the hour
    if 5 <= hour < 12:
        return 'Morning'
    elif 12 <= hour < 17:
        return 'Afternoon'
    elif 17 <= hour < 21:
        return 'Evening'
    else:
        return 'Night'

df_economy['dep_time'] = df_economy['dep_time'].apply(time_to_category)
df_economy['arr_time'] = df_economy['arr_time'].apply(time_to_category)
df_business['dep_time'] = df_business['dep_time'].apply(time_to_category)
df_business['arr_time'] = df_business['arr_time'].apply(time_to_category)
df_economy

,date,airline,dep_time,from,time_taken,stop,arr_time,to,price,flight_number
0,11-02-2022,SpiceJet,Evening,Delhi,2.166667,0,Night,Mumbai,"5,953",SG8709
1,11-02-2022,SpiceJet,Morning,Delhi,2.333333,0,Morning,Mumbai,"5,953",SG8157
2,11-02-2022,AirAsia,Night,Delhi,2.166667,0,Morning,Mumbai,"5,956",I5764
3,11-02-2022,Vistara,Morning,Delhi,2.250000,0,Afternoon,Mumbai,"5,955",UK995
4,11-02-2022,Vistara,Morning,Delhi,2.333333,0,Morning,Mumbai,"5,955",UK963
...,...,...,...,...,...,...,...,...,...,...
206769,31-03-2022,Vistara,Morning,Chennai,13.833333,1,Evening,Hyderabad,"7,697",UK832
206770,31-03-2022,Vistara,Morning,Chennai,13.833333,1,Evening,Hyderabad,"7,709",UK832
206771,31-03-2022,Vistara,Afternoon,Chennai,20.583333,1,Morning,Hyderabad,"8,640",UK826
206772,31-03-2022,Vistara,Morning,Chennai,23.333333,1,Morning,Hyderabad,"8,640",UK822
206773,31-03-2022,Vistara,Evening,Chennai,24.416667,1,Evening,Hyderabad,"8,640",UK824

### Compute distances between cities (precompute to save time), to include a new distance feature that better represent the from and to features

In [146]:
from geopy.geocoders import Nominatim
from geopy.distance import geodesic

# Initialize the geolocator
geolocator = Nominatim(user_agent="geoapi")

# Function to get coordinates of a city
def get_coordinates(city_name):
    location = geolocator.geocode(city_name)
    if location:
        return location.latitude, location.longitude
    else:
        return None
    
distances = dict()

def get_distance(city1, city2):
    # Create a sorted tuple key for consistent lookups (city1, city2) == (city2, city1)
    if city1 == city2:
        return 0
    
    key = tuple(sorted([city1, city2]))
    
    if key not in distances:
        coords1 = get_coordinates(city1)
        coords2 = get_coordinates(city2)
        
        if coords1 and coords2:
            distances[key] = geodesic(coords1, coords2).kilometers
        else:
            distances[key] = None  # Handle cases where coordinates are not found
    
    return distances[key]

In [147]:
unique_cities = set(pd.unique(df_economy['from']).tolist() + pd.unique(df_economy['to']).tolist() + pd.unique(df_business['from']).tolist() + pd.unique(df_business['to']).tolist())
for city in unique_cities:
    for city2 in unique_cities:
        get_distance(city, city2)

In [148]:
df_economy['distance'] = df_economy.apply(
    lambda row: get_distance(row['from'], row['to']),
    axis=1
)
df_economy

,date,airline,dep_time,from,time_taken,stop,arr_time,to,price,flight_number,distance
0,11-02-2022,SpiceJet,Evening,Delhi,2.166667,0,Night,Mumbai,"5,953",SG8709,1146.935458
1,11-02-2022,SpiceJet,Morning,Delhi,2.333333,0,Morning,Mumbai,"5,953",SG8157,1146.935458
2,11-02-2022,AirAsia,Night,Delhi,2.166667,0,Morning,Mumbai,"5,956",I5764,1146.935458
3,11-02-2022,Vistara,Morning,Delhi,2.250000,0,Afternoon,Mumbai,"5,955",UK995,1146.935458
4,11-02-2022,Vistara,Morning,Delhi,2.333333,0,Morning,Mumbai,"5,955",UK963,1146.935458
...,...,...,...,...,...,...,...,...,...,...,...
206769,31-03-2022,Vistara,Morning,Chennai,13.833333,1,Evening,Hyderabad,"7,697",UK832,511.055118
206770,31-03-2022,Vistara,Morning,Chennai,13.833333,1,Evening,Hyderabad,"7,709",UK832,511.055118
206771,31-03-2022,Vistara,Afternoon,Chennai,20.583333,1,Morning,Hyderabad,"8,640",UK826,511.055118
206772,31-03-2022,Vistara,Morning,Chennai,23.333333,1,Morning,Hyderabad,"8,640",UK822,511.055118
206773,31-03-2022,Vistara,Evening,Chennai,24.416667,1,Evening,Hyderabad,"8,640",UK824,511.055118

In [149]:
df_business['distance'] = df_business.apply(
    lambda row: get_distance(row['from'], row['to']),
    axis=1
)
df_business

,date,airline,dep_time,from,time_taken,stop,arr_time,to,price,flight_number,distance
0,11-02-2022,Air India,Evening,Delhi,2.000000,0,Evening,Mumbai,"25,612",AI868,1146.935458
1,11-02-2022,Air India,Evening,Delhi,2.250000,0,Night,Mumbai,"25,612",AI624,1146.935458
2,11-02-2022,Air India,Evening,Delhi,24.750000,1,Evening,Mumbai,"42,220",AI531,1146.935458
3,11-02-2022,Air India,Night,Delhi,26.500000,1,Night,Mumbai,"44,450",AI839,1146.935458
4,11-02-2022,Air India,Evening,Delhi,6.666667,1,Night,Mumbai,"46,690",AI544,1146.935458
...,...,...,...,...,...,...,...,...,...,...,...
93482,31-03-2022,Vistara,Morning,Chennai,10.083333,1,Evening,Hyderabad,"69,265",UK822,511.055118
93483,31-03-2022,Vistara,Afternoon,Chennai,10.416667,1,Night,Hyderabad,"77,105",UK826,511.055118
93484,31-03-2022,Vistara,Morning,Chennai,13.833333,1,Evening,Hyderabad,"79,099",UK832,511.055118
93485,31-03-2022,Vistara,Morning,Chennai,10.000000,1,Evening,Hyderabad,"81,585",UK828,511.055118
93486,31-03-2022,Vistara,Morning,Chennai,10.083333,1,Evening,Hyderabad,"81,585",UK822,511.055118

### Convert comma-formatted price string to numerical value

In [150]:
# price fix
df_economy['price'] = df_economy['price'].astype(str).str.replace(",", "").astype(int)
df_business['price'] = df_business['price'].astype(str).str.replace(",", "").astype(int)
df_economy

,date,airline,dep_time,from,time_taken,stop,arr_time,to,price,flight_number,distance
0,11-02-2022,SpiceJet,Evening,Delhi,2.166667,0,Night,Mumbai,5953,SG8709,1146.935458
1,11-02-2022,SpiceJet,Morning,Delhi,2.333333,0,Morning,Mumbai,5953,SG8157,1146.935458
2,11-02-2022,AirAsia,Night,Delhi,2.166667,0,Morning,Mumbai,5956,I5764,1146.935458
3,11-02-2022,Vistara,Morning,Delhi,2.250000,0,Afternoon,Mumbai,5955,UK995,1146.935458
4,11-02-2022,Vistara,Morning,Delhi,2.333333,0,Morning,Mumbai,5955,UK963,1146.935458
...,...,...,...,...,...,...,...,...,...,...,...
206769,31-03-2022,Vistara,Morning,Chennai,13.833333,1,Evening,Hyderabad,7697,UK832,511.055118
206770,31-03-2022,Vistara,Morning,Chennai,13.833333,1,Evening,Hyderabad,7709,UK832,511.055118
206771,31-03-2022,Vistara,Afternoon,Chennai,20.583333,1,Morning,Hyderabad,8640,UK826,511.055118
206772,31-03-2022,Vistara,Morning,Chennai,23.333333,1,Morning,Hyderabad,8640,UK822,511.055118
206773,31-03-2022,Vistara,Evening,Chennai,24.416667,1,Evening,Hyderabad,8640,UK824,511.055118

In [151]:
df_business

,date,airline,dep_time,from,time_taken,stop,arr_time,to,price,flight_number,distance
0,11-02-2022,Air India,Evening,Delhi,2.000000,0,Evening,Mumbai,25612,AI868,1146.935458
1,11-02-2022,Air India,Evening,Delhi,2.250000,0,Night,Mumbai,25612,AI624,1146.935458
2,11-02-2022,Air India,Evening,Delhi,24.750000,1,Evening,Mumbai,42220,AI531,1146.935458
3,11-02-2022,Air India,Night,Delhi,26.500000,1,Night,Mumbai,44450,AI839,1146.935458
4,11-02-2022,Air India,Evening,Delhi,6.666667,1,Night,Mumbai,46690,AI544,1146.935458
...,...,...,...,...,...,...,...,...,...,...,...
93482,31-03-2022,Vistara,Morning,Chennai,10.083333,1,Evening,Hyderabad,69265,UK822,511.055118
93483,31-03-2022,Vistara,Afternoon,Chennai,10.416667,1,Night,Hyderabad,77105,UK826,511.055118
93484,31-03-2022,Vistara,Morning,Chennai,13.833333,1,Evening,Hyderabad,79099,UK832,511.055118
93485,31-03-2022,Vistara,Morning,Chennai,10.000000,1,Evening,Hyderabad,81585,UK828,511.055118
93486,31-03-2022,Vistara,Morning,Chennai,10.083333,1,Evening,Hyderabad,81585,UK822,511.055118